
Функция ЛюбойURLМетодGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Calling 1C functions from Ollama");
	Возврат Ответ;
	
КонецФункции

Функция ЛюбойURLМетодPOST(Запрос)
	
	ДанныеЗапроса = ОбщегоНазначения.ЗначениеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	ИмяПоказателя = ДанныеЗапроса.name;
	Дата = ПолучитьДатуИзСтроки(ДанныеЗапроса.date);
	
	Если ИмяПоказателя = "store" Тогда
		Значение = 3 * (Месяц(Дата) * 1000 + ДеньГода(Дата));
	ИначеЕсли ИмяПоказателя = "money" Тогда
		Значение = 5 * (Месяц(Дата) * 1000 + ДеньГода(Дата));
	Иначе
		Значение = 0;
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("value", Значение);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ОбщегоНазначения.СтрокаJSONИзЗначения(ДанныеОтвета));
	Возврат Ответ;
	
КонецФункции

#Область ПриведениеТипов

Функция ПолучитьДатуИзСтроки(Знач ДатаСтрока)
	
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "-", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "T", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, ":", "");
	
	ПрименитьМестноеВремя = Ложь;
	
	РазделительЧасовогоПояса = СтрНайти(ДатаСтрока, ".");
	Если РазделительЧасовогоПояса = 0 Тогда
		РазделительЧасовогоПояса = СтрНайти(ДатаСтрока, "+");
	КонецЕсли;
	Если РазделительЧасовогоПояса = 0 Тогда
		РазделительЧасовогоПояса = СтрДлина(ДатаСтрока) + 1;
	Иначе
		ПрименитьМестноеВремя = Истина;
	КонецЕсли;
	ДатаСтрока = Лев(ДатаСтрока, РазделительЧасовогоПояса - 1);
	Дата = Дата(ДатаСтрока);
	Если ПрименитьМестноеВремя Тогда
		Дата = МестноеВремя(Дата);
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

#КонецОбласти
